---
kind: property
id: P:Autodesk.Revit.UI.ContextualHelp.HelpType
source: html/45a49ec1-e72d-9dc4-551c-1bb6757ac6f2.htm
---
# Autodesk.Revit.UI.ContextualHelp.HelpType Property

The contextual help type.

## Syntax (C#)
```csharp
public ContextualHelpType HelpType { get; set; }
```